Autodesk.Revit.DB.Control.View
The view.

Autodesk.Revit.DB.Control.Origin
The control origin.

Autodesk.Revit.DB.Control.Shape
The control shape.

Autodesk.Revit.DB.Control
A control in Autodesk Revit family document.
Remarks:
The object represents a variety of different shapes of controls in family document.
The different shapes of controls can handle the family instance in different ways.
A vertical/horizontal arrow control rotates the instance by 180 degrees.A double vertical arrow control mirrors the instance geometry vertically.A double horizontal arrow control mirrors the instance geometry horizontally.